tests/MessageReplay.Tests/JsonToSoap/JsonToSoapConverterTests.When_receiving_clearance_request_soap_Then_should_convert_to_json_AlvsToCds.verified.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <oas:Security soap:role="system" soap:mustUnderstand="true" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <oas:UsernameToken>
        <oas:Username>ibmtest</oas:Username>
        <oas:Password>password</oas:Password>
      </oas:UsernameToken>
    </oas:Security>
  </soap:Header>
  <soap:Body>
    <DecisionNotification xmlns="http://uk.gov.hmrc.ITSW2.ws">
      <DecisionNotification xmlns="http://www.hmrc.gov.uk/webservices/itsw/ws/decisionnotification">
        <ServiceHeader>
          <SourceSystem>ALVS</SourceSystem>
          <DestinationSystem>CDS</DestinationSystem>
          <CorrelationId>000</CorrelationId>
          <ServiceCallTimestamp>2023-06-30T07:34:14.405827</ServiceCallTimestamp>
        </ServiceHeader>
        <Header>
          <EntryReference>23GB1234567890ABC8</EntryReference>
          <EntryVersionNumber>1</EntryVersionNumber>
          <DecisionNumber>1</DecisionNumber>
        </Header>
        <Item>
          <ItemNumber>1</ItemNumber>
          <Check>
            <CheckCode>H218</CheckCode>
            <DecisionCode>C02</DecisionCode>
            <DecisionValidUntil>202307042359</DecisionValidUntil>
          </Check>
          <Check>
            <CheckCode>H219</CheckCode>
            <DecisionCode>C03</DecisionCode>
          </Check>
          <Check>
            <CheckCode>H223</CheckCode>
            <DecisionCode>C03</DecisionCode>
          </Check>
        </Item>
        <Item>
          <ItemNumber>2</ItemNumber>
          <Check>
            <CheckCode>H219</CheckCode>
            <DecisionCode>C03</DecisionCode>
          </Check>
          <Check>
            <CheckCode>H223</CheckCode>
            <DecisionCode>C03</DecisionCode>
          </Check>
        </Item>
      </DecisionNotification>
    </DecisionNotification>
  </soap:Body>
</soap:Envelope>